bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/img_proc.c
            for (i = 0; i < LSC_COEF_NUM; i++) {
                /* interpolate each coef of LSC R */
                point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_coef_r.coef[i]);
                point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_coef_r.coef[i]);
                linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc.lsc_coef_r.coef[i]));
            }

            for (i = 0; i < LSC_COEF_NUM; i++) {
                /* interpolate each coef of LSC G */
                point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_coef_g.coef[i]);
                point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_coef_g.coef[i]);
                linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc.lsc_coef_g.coef[i]));
            }

            for (i = 0; i < LSC_COEF_NUM; i++) {
                /* interpolate each coef of LSC B */
                point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_coef_b.coef[i]);
                point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_coef_b.coef[i]);
                linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc.lsc_coef_b.coef[i]));
            }

            point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_max.max_r);
            point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_max.max_r);
            linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc_max.max_r));
            point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_max.max_g);
            point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_max.max_g);
            linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc_max.max_g));
            point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_max.max_b);
            point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_max.max_b);
            linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc_max.max_b));

            break;
        } else if (lsc_idx == 0 && color_temp < color_temp_L) {
            for (i = 0; i < LSC_COEF_NUM; i++) {
                isp_cfg.lsc.lsc_coef_r.coef[i] = lsc_corr_L->lsc_coef_r.coef[i];
                isp_cfg.lsc.lsc_coef_g.coef[i] = lsc_corr_L->lsc_coef_g.coef[i];
                isp_cfg.lsc.lsc_coef_b.coef[i] = lsc_corr_L->lsc_coef_b.coef[i];
            }

            isp_cfg.lsc_max.max_r = lsc_corr_L->lsc_max.max_r;
            isp_cfg.lsc_max.max_g = lsc_corr_L->lsc_max.max_g;
            isp_cfg.lsc_max.max_b = lsc_corr_L->lsc_max.max_b;
            break;
        } else if (lsc_idx == (lsc_num - 2) && color_temp > color_temp_H) {
            for (i = 0; i < LSC_COEF_NUM; i++) {
                isp_cfg.lsc.lsc_coef_r.coef[i] = lsc_corr_H->lsc_coef_r.coef[i];
                isp_cfg.lsc.lsc_coef_g.coef[i] = lsc_corr_H->lsc_coef_g.coef[i];
                isp_cfg.lsc.lsc_coef_b.coef[i] = lsc_corr_H->lsc_coef_b.coef[i];
            }

            isp_cfg.lsc_max.max_r = lsc_corr_H->lsc_max.max_r;
            isp_cfg.lsc_max.max_g = lsc_corr_H->lsc_max.max_g;
            isp_cfg.lsc_max.max_b = lsc_corr_H->lsc_max.max_b;
            break;
        }
    }

    //    //MSG("img_update_lsc: %d, %d, %d\r\n", isp_cfg.lsc.lsc_coef_r.coef[0], isp_cfg.lsc.lsc_coef_r.coef[1],
    //        isp_cfg.lsc.lsc_coef_r.coef[2]);

    return 0;
}

static int calc_ccm_by_color_temp(BL_COLOR_TEMP color_temp, ISP_CCM_COEF_S *ccm)
{
    int ccm_idx, i;
    int ccm_num = img_param_get_num_color_corr();
    BL_COLOR_TEMP color_temp_L, color_temp_H;
    const color_corr_t *color_corr_L, *color_corr_H;
    intpl_point_t point_L, point_H;

    for (ccm_idx = 0; ccm_idx < (ccm_num - 1); ccm_idx++) {
        img_param_get_color_corr(ccm_idx, &color_corr_L);
        img_param_get_color_corr(ccm_idx + 1, &color_corr_H);

        color_temp_L = color_corr_L->color_temp;
        color_temp_H = color_corr_H->color_temp;

        if (color_temp >= color_temp_L && color_temp <= color_temp_H) {
            /* now we get the range of color temp */

            for (i = 0; i < CCM_COEF_NUM; i++) {
                /* interpolate each coef of CCM */
                point_L = create_intpl_point(color_temp_L, color_corr_L->ccm.ccm_coef[i]);
                point_H = create_intpl_point(color_temp_H, color_corr_H->ccm.ccm_coef[i]);
                linear_interpolate(&point_L, &point_H, color_temp, &ccm->ccm_coef[i]);
            }

            return 0;
        } else if (ccm_idx == 0 && color_temp < color_temp_L) {
            for (i = 0; i < CCM_COEF_NUM; i++) {
                ccm->ccm_coef[i] = color_corr_L->ccm.ccm_coef[i];
            }

            return 0;
        } else if (ccm_idx == (ccm_num - 2) && color_temp > color_temp_H) {
            for (i = 0; i < CCM_COEF_NUM; i++) {
                ccm->ccm_coef[i] = color_corr_H->ccm.ccm_coef[i];
            }

            return 0;
        }
    }

    /* shouldn't reach here */
    return -1;
}

static int img_update_ccm(BL_COLOR_TEMP color_temp)
{
    ISP_CCM_COEF_S ccm;

    if (!imgproc_is_module_enable(ISP_ADJ_CCM)) {
        for (int i = 0; i < CCM_COEF_NUM; i++) {
            ccm.ccm_coef[i] = 0;
        }

        ccm.ccm_coef[0] = 512;
        ccm.ccm_coef[4] = 512;
        ccm.ccm_coef[8] = 512;
        ISP_Set_CCM_Coef(&ccm);

        return -1;
    }

    imgproc_set_module_update(IMG_UPDATE_MASK_CCM);
    calc_ccm_by_color_temp(color_temp, &(isp_cfg.ccm));
    return 0;
}

static int calc_gamma_by_sys_gain(BL_GAIN_DB sys_gain, ISP_Gamma_Curve_Type *gamma)
{
    int i, value, gamma_idx, num_gamma;
    int ret = -1;
    BL_GAIN_DB sys_gain_L, sys_gain_H;
    const gamma_corr_t *gamma_L, *gamma_H;
    intpl_point_t point_L, point_H;

    num_gamma = img_param_get_num_gamma_corr();
    CHECK_PARAM(num_gamma >= 2);

    for (gamma_idx = 0; gamma_idx < (num_gamma - 1); gamma_idx++) {
        img_param_get_gamma_corr(gamma_idx, &gamma_L);
        img_param_get_gamma_corr(gamma_idx + 1, &gamma_H);

