bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/img_proc.c
        sys_gain_L = INT_TO_GAIN_DB(gamma_L->sys_gain_db);
        sys_gain_H = INT_TO_GAIN_DB(gamma_H->sys_gain_db);

        if (sys_gain >= sys_gain_L && sys_gain <= sys_gain_H) {
            for (i = 0; i < GAMMA_COEF_NUM; i++) {
                /* interpolate each coef of gamma */
                point_L = create_intpl_point(sys_gain_L, gamma_L->gamma_curve.coef[i]);
                point_H = create_intpl_point(sys_gain_H, gamma_H->gamma_curve.coef[i]);
                linear_interpolate(&point_L, &point_H, sys_gain, &value);
                gamma->curve_coef[i] = value;
            }

            ret = 0;
            break;
        } else if (gamma_idx == 0 && sys_gain < sys_gain_L) {
            for (i = 0; i < GAMMA_COEF_NUM; i++) {
                gamma->curve_coef[i] = gamma_L->gamma_curve.coef[i];
            }

            ret = 0;
            break;
        } else if (gamma_idx == (num_gamma - 2) && sys_gain > sys_gain_H) {
            for (i = 0; i < GAMMA_COEF_NUM; i++) {
                gamma->curve_coef[i] = gamma_H->gamma_curve.coef[i];
            }

            ret = 0;
            break;
        }
    }

    return ret;
}

static int img_update_gamma(BL_GAIN_DB sys_gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_GAMMA)) {
        return -1;
    }

    imgproc_set_module_update(IMG_UPDATE_MASK_GAMMA);
    calc_gamma_by_sys_gain(sys_gain, &(isp_cfg.gamma));
    return 0;
}

static int calc_wdr_fw_config_by_sys_gain(BL_GAIN_DB sys_gain, wdr_fw_config_t *wdr_fw_config)
{
    int wdr_fw_config_idx;
    BL_GAIN_DB sys_gain_L, sys_gain_H;
    const wdr_fw_config_t *wdr_fw_config_L, *wdr_fw_config_H;
    intpl_point_t point_L, point_H;
    int num_wdr_fw_config = img_param_get_num_wdr_config();

    for (wdr_fw_config_idx = 0; wdr_fw_config_idx < (num_wdr_fw_config - 1); wdr_fw_config_idx++) {
        img_param_get_wdr_config(wdr_fw_config_idx, &wdr_fw_config_L);
        img_param_get_wdr_config(wdr_fw_config_idx + 1, &wdr_fw_config_H);

        sys_gain_L = INT_TO_GAIN_DB(wdr_fw_config_L->sys_gain_db);
        sys_gain_H = INT_TO_GAIN_DB(wdr_fw_config_H->sys_gain_db);

        if (sys_gain >= sys_gain_L && sys_gain <= sys_gain_H) {
            /* now we get the range of sys gain */

            // /* interpolate cs weight */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.cs_weight);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.cs_weight);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.cs_weight));

            // /* interpolate cs gain_thresh */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.cs_gain_thresh);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.cs_gain_thresh);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.cs_gain_thresh));

            /* interpolate curve_weight */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.curve_weight);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.curve_weight);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.curve_weight));

            /* interpolate enh_weight */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.enh_weight);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.enh_weight);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.enh_weight));

            /* interpolate enh_c_gain_extra_slope */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.enh_c_gain_extra_slope);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.enh_c_gain_extra_slope);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.enh_c_gain_extra_slope));
            return 0;
        }

        if (wdr_fw_config_idx == 0 && sys_gain < sys_gain_L) {
            *wdr_fw_config = *wdr_fw_config_L;
            return 0;
        }

        if (wdr_fw_config_idx == (num_wdr_fw_config - 2) && sys_gain > sys_gain_H) {
            *wdr_fw_config = *wdr_fw_config_H;
            return 0;
        }
    }

    /* should never reach here */
    return -1;
}

static int img_update_wdr(BL_GAIN_DB sys_gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_WDR)) {
        return -1;
    }

    wdr_fw_config_t wdr_fw_config;
    imgproc_set_module_update(IMG_UPDATE_MASK_WDR);
    calc_wdr_fw_config_by_sys_gain(sys_gain, &wdr_fw_config);
    wdr_control(&wdr_fw_config);

    return 0;
}

static int img_update_saturation(BL_GAIN_DB gain)
{
    ISP_SATURATION_S satCfg;

    if (!imgproc_is_module_enable(ISP_ADJ_SATURATION)) {
        satCfg.saturation_cb = 0;
        satCfg.saturation_cr = 0;
        ISP_Set_Saturation(&satCfg);

        return -1;
    }

    int param_idx;
    const saturation_t *saturation_L, *saturation_H;

    param_idx = gain / GAIN_6_DB;
    imgproc_set_module_update(IMG_UPDATE_MASK_SATURATION);

    img_param_get_saturation(param_idx, &saturation_L);
    img_param_get_saturation(param_idx + 1, &saturation_H);

    linear_intpl_by_gain(saturation_L->value, saturation_H->value, gain, &(isp_cfg.saturation));

    //    //MSG("saturation: (%d ~ %d) -> %d\r\n", saturation_L, saturation_H, saturation_new);

    return 0;
}

static int img_set_default_ee_luma_weight(void)
{
    int i;
    const ee_luma_wgt_t *lumaWgt;
    ISP_EE_Luma_Weight_Type lumaWgtCfg;

    img_param_get_default_EE_luma_weight(&lumaWgt);

    for (i = 0; i < ISP_EE_LUMA_WEIGHT_NUM; i++) {
        lumaWgtCfg.lumaWgtTbl[i] = lumaWgt->lumaWgtTbl[i];
    }

    ISP_Set_EE_LumaWeight(&lumaWgtCfg);

    return 0;
}

static int img_update_ee(BL_GAIN_DB gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_EE)) {
        return -1;
    }

    int param_idx;
    const edge_enhance_t *edge_enhance_L, *edge_enhance_H;
    int value;

    param_idx = gain / GAIN_6_DB;
    imgproc_set_module_update(IMG_UPDATE_MASK_EE);

    img_param_get_edge_enhance(param_idx, &edge_enhance_L);
    img_param_get_edge_enhance(param_idx + 1, &edge_enhance_H);

    linear_intpl_by_gain(edge_enhance_L->posEdgeStr, edge_enhance_H->posEdgeStr, gain, &value);
    isp_cfg.ee_str.posEdgeStr = value;
    linear_intpl_by_gain(edge_enhance_L->negEdgeStr, edge_enhance_H->negEdgeStr, gain, &value);
    isp_cfg.ee_str.negEdgeStr = value;
    linear_intpl_by_gain(edge_enhance_L->posEdgeOvrshtStr, edge_enhance_H->posEdgeOvrshtStr, gain, &value);
    isp_cfg.ee_str.posEdgeOvrshtStr = value;
    linear_intpl_by_gain(edge_enhance_L->negEdgeOvrshtStr, edge_enhance_H->negEdgeOvrshtStr, gain, &value);
    isp_cfg.ee_str.negEdgeOvrshtStr = value;
    linear_intpl_by_gain(edge_enhance_L->nrStr, edge_enhance_H->nrStr, gain, &value);
    isp_cfg.ee_str.nrStr = value;
    linear_intpl_by_gain(edge_enhance_L->dirShpnessThresh, edge_enhance_H->dirShpnessThresh, gain, &value);
    isp_cfg.ee_th.dirShpnessThresh = value;
    linear_intpl_by_gain(edge_enhance_L->noDirShpnessThresh, edge_enhance_H->noDirShpnessThresh, gain, &value);
    isp_cfg.ee_th.noDirShpnessThresh = value;
    linear_intpl_by_gain(edge_enhance_L->flatThresh, edge_enhance_H->flatThresh, gain, &value);
    isp_cfg.ee_th.flatThresh = value;
    linear_intpl_by_gain(edge_enhance_L->textureThresh, edge_enhance_H->textureThresh, gain, &value);
    isp_cfg.ee_th.textureThresh = value;
    linear_intpl_by_gain(edge_enhance_L->edgeThresh, edge_enhance_H->edgeThresh, gain, &value);
    isp_cfg.ee_th.edgeThresh = value;
    //    //MSG("EE: noise_thresh (%d ~ %d) -> %d\r\n", edge_enhance_L->noise_thresh, edge_enhance_H->noise_thresh, noise_thresh);

