bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/img_proc.c
    return 0;
}

static int img_update_nr(BL_GAIN_DB gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_NR)) {
        ISP_Set_Noise_Level(0);
        return -1;
    }

    int param_idx;
    const noise_reduction_t *noise_reduct_L, *noise_reduct_H;

    param_idx = gain / GAIN_6_DB;
    imgproc_set_module_update(IMG_UPDATE_MASK_NOISE_LEVEL);

    img_param_get_noise_reduction(param_idx, &noise_reduct_L);
    img_param_get_noise_reduction(param_idx + 1, &noise_reduct_H);

    linear_intpl_by_gain(noise_reduct_L->noise_level, noise_reduct_H->noise_level, gain, &(isp_cfg.noise_lv));
    //    //MSG("NR: noise_level (%d ~ %d) -> %d\r\n", noise_reduct_L->noise_level, noise_reduct_H->noise_level, noise_level);

    return 0;
}

static int img_update_cs(BL_GAIN_DB gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_CS)) {
        return -1;
    }

    int param_idx, value, divisor;
    const chroma_suppress_t *chroma_suppress_L, *chroma_suppress_H;

    param_idx = gain / GAIN_6_DB;
    imgproc_set_module_update(IMG_UPDATE_MASK_CS);

    img_param_get_chroma_suppress(param_idx, &chroma_suppress_L);
    img_param_get_chroma_suppress(param_idx + 1, &chroma_suppress_H);

    linear_intpl_by_gain(chroma_suppress_L->weight, chroma_suppress_H->weight, gain, &value);
    isp_cfg.cs.weight = value;
    linear_intpl_by_gain(chroma_suppress_L->gain_thresh, chroma_suppress_H->gain_thresh, gain, &value);
    isp_cfg.cs.grey_thr = value;

    // ref to wdr
    divisor = (1 << (8 - 1)) - isp_cfg.cs.grey_thr;
    isp_cfg.cs.gain = ((1 << (8 - 1)) * (1 << 8) + (divisor - 1)) / divisor;

    return 0;
}

static void imgproc_set_init_only_module()
{
    img_update_blc();
}

static void load_isp_back_reg(void)
{
    uint32_t i;
    uint32_t tmpVal;
    
    for(i=0;i<sizeof(isp_back_array)/4;i++){
        tmpVal = isp_back_array[4*i]|isp_back_array[4*i+1]<<8|isp_back_array[4*i+2]<<16|isp_back_array[4*i+3]<<24;
        *(volatile uint32_t*)(0x30011328+4*i) = tmpVal;
    }
}

static int img_set_module_param(void)
{
    uint8_t nr_str;

    img_param_get_default_2DNR_str(&nr_str);
    ISP_Set_2D_NR(nr_str);

    img_param_get_default_3DNR_str(&nr_str);
#if ENABLE_3DNR
    ISP_Set_3D_NR(nr_str);
#endif

    img_set_default_ee_luma_weight();

    return 0;
}

static bool imgproc_is_update_force()
{
    return ((0 != img_proc.update_force) ? true : false);
}

static void imgproc_update_down()
{
    if (img_proc.update_force > 0) {
        img_proc.update_force--;
    }
}

// only for debug mode
int imgproc_update_force()
{
    img_proc.update_force = 3;
    return 0;
}

static int imgproc_is_boot_frame()
{
    if (0 != img_proc.start_skip_num && img_proc.start_skip_num-- > 0) {
        return 1;
    }

    return 0;
}

static int imgproc_is_skip_frame(int *count)
{
    if ((*count)++ < img_proc.skip_num - 1) {
        return 1;
    }

    *count = 0;
    return 0;
}

#if 0
static void imgproc_set_interrupt(BL_Fun_Type state)
{
    if(DISABLE == state)
    {
        CPU_Interrupt_Disable(ISP_AE_IRQn);
        CPU_Interrupt_Disable(ISP_AWB0_IRQn);
        CPU_Interrupt_Disable(ISP_AWB1_IRQn);
        CPU_Interrupt_Disable(ISP_WDR_IRQn);

        CPU_Interrupt_Disable(SEOF_INT0_IRQn);
        CPU_Interrupt_Disable(SEOF_INT1_IRQn);
        CPU_Interrupt_Disable(SEOF_INT2_IRQn);
    }
    else
    {
        CPU_Interrupt_Enable(ISP_AE_IRQn);

        if(AWB_ALGO_1 == img_proc.awb_algo)
        {
            CPU_Interrupt_Enable(ISP_AWB0_IRQn);
        }
        else if(AWB_ALGO_2 == img_proc.awb_algo)
        {
            CPU_Interrupt_Enable(ISP_AWB1_IRQn);
        }
        else
        {
            //MSG("AWB algo NOT Support!\r\n");
        }

        CPU_Interrupt_Enable(ISP_WDR_IRQn);

        CPU_Interrupt_Enable(SEOF_INT0_IRQn);
        CPU_Interrupt_Enable(SEOF_INT1_IRQn);
        CPU_Interrupt_Enable(SEOF_INT2_IRQn);
    }
}
#endif

void imgproc_dbg_set_awb_algo(AWB_ALGO algo)
{
    img_procawb_algo_new = algo;
}

int imgproc_init(void)
{
    int ret;

    memset(&img_proc, 0, sizeof(img_proc));
    memset(&isp_cfg, 0, sizeof(isp_cfg));

    ret = img_param_get_module(&(img_proc.img_param));

    if (-1 == ret) {
        //MSG("improc: Get sensor param failed!\n");
    }

    ret = imgproc_check_param_table();

    if (-1 == ret) {
        //MSG("improc: Please check module table!\n");
    }

    ret = imgproc_check_param_policy();

    if (-1 == ret) {
        //MSG("improc: Please check module policy!\n");
    }

    img_proc.skip_num = IMG_PROC_SKIP_NUM;
    img_proc.start_skip_num = IMG_START_SKIP_NUM;
    img_proc.awb_algo = img_procawb_algo_new;

    //imgproc_set_interrupt(DISABLE);

    //ae_init();
    //awb_init(img_proc.awb_algo);
    //wdr_init();
    //ir_board_config();
    //sensor_board_config();

    return 0;
}

int imgproc_bind_sensor_model(const char *sensor_name)
{
    return img_param_load(sensor_name);
}

int imgproc_set_config(img_proc_cfg_t *cfg, bool is_virtual_sensor)
{
    ae_config_t ae_cfg;
    awb_config_t awb_cfg;
    wdr_config_t wdr_cfg;

    memcpy(&(ae_cfg.stats_cfg), &(cfg->stats_cfg), sizeof(aaa_stats_cfg_t));
    memcpy(&(awb_cfg.stats_cfg), &(cfg->stats_cfg), sizeof(aaa_stats_cfg_t));
    memcpy(&(wdr_cfg.stats_cfg), &(cfg->stats_cfg), sizeof(aaa_stats_cfg_t));

    if (ae_config(&ae_cfg, is_virtual_sensor) < 0) {
        return -1;
    }

    if (awb_config(&awb_cfg, is_virtual_sensor) < 0) {
        return -1;
    }

    if (wdr_config(&wdr_cfg, is_virtual_sensor) < 0) {
        return -1;
    }

    img_set_module_param();

    return 0;
}

void vImageControlTask(void)
{
    int skip_cnt = img_proc.skip_num;

    ae_info_t *ae_info;
    awb_info_t *awb_info;
    ae_get_info(&ae_info);
    awb_get_info(&awb_info);

    imgproc_update_force();
    imgproc_set_init_only_module();

    /* interrupts should be enabled after scheduler is started,
        otherwise deferring any work in ISR to Daemon task will assert */

    //imgproc_set_interrupt(ENABLE);

    while (!img_proc.stop_imgproc_flag) {
        if (imgproc_is_skip_frame(&skip_cnt)) {
            //continue;
        }

        img_update_ae();
        img_update_awb();

        if (imgproc_is_boot_frame()) {
            //continue;
        }

        if (ae_info->expo_time_update || imgproc_is_update_force()) {
            if (ae_info->ae_mode != AE_MODE_DBG_VIRTUAL) {
                sensor_expo_time = ae_info->expo_time;
            }
        }

        if (ae_info->iso_update || imgproc_is_update_force()) {
            if (ae_info->ae_mode != AE_MODE_DBG_VIRTUAL) {
                sensor_gain = ae_info->iso;
            }
        }

