bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/img_proc.c
        if (ae_info->sys_gain_update || imgproc_is_update_force()) {
            img_update_wdr(ae_info->sys_gain);

            if (AWB_ALGO_1 == img_proc.awb_algo) {
                img_update_wb_bias(ae_info->sys_gain, &(awb_info->rb_bias));
            }

            img_update_gamma(ae_info->sys_gain);
        }

        if (ae_info->iso_update || imgproc_is_update_force()) {
            img_update_ae_target(ae_info->iso, &(ae_info->luma_target));
            img_update_dpc(ae_info->iso);
            img_update_cs(ae_info->iso);
            img_update_ee(ae_info->iso);
            img_update_nr(ae_info->iso);
            img_update_saturation(ae_info->iso);
        }

        if (awb_info->rb_gain_update || imgproc_is_update_force()) {
            if (AWB_ALGO_1 == img_proc.awb_algo) {
                img_update_wb_gain(&(awb_info->rb_gain), awb_info->color_temp, &(awb_info->rb_bias));
            }
        }

        if (awb_info->ct_update || imgproc_is_update_force()) {
            img_update_ccm(awb_info->color_temp);
            img_update_lsc(awb_info->color_temp);
        }

        imgproc_set_reg();

        imgproc_update_down();

        //imgproc_night_mode_enable(true);

#if PERFORMANCE_MONITOR
        do_frame_rate_stats("img handl", &ae_handl_cnt, FRM_CNT_FOR_ONE_STATS, &ae_handl_start_time);
#endif
    }
}

void imgproc_control_init(void)
{
    int skip_cnt = img_proc.skip_num;

    ae_info_t *ae_info;
    awb_info_t *awb_info;
    ae_get_info(&ae_info);
    awb_get_info(&awb_info);

    imgproc_update_force();
    imgproc_set_init_only_module();

    /* interrupts should be enabled after scheduler is started,
        otherwise deferring any work in ISR to Daemon task will assert */

    //imgproc_set_interrupt(ENABLE);

    if (imgproc_is_skip_frame(&skip_cnt)) {
        //continue;
    }

    img_update_ae();
    img_update_awb();

    if (imgproc_is_boot_frame()) {
        //continue;
    }

    if (ae_info->expo_time_update || imgproc_is_update_force()) {
        if (ae_info->ae_mode != AE_MODE_DBG_VIRTUAL) {
            sensor_expo_time = ae_info->expo_time;
        }
    }

    if (ae_info->iso_update || imgproc_is_update_force()) {
        if (ae_info->ae_mode != AE_MODE_DBG_VIRTUAL) {
            sensor_gain = ae_info->iso;
        }
    }

    if (ae_info->sys_gain_update || imgproc_is_update_force()) {
        img_update_wdr(ae_info->sys_gain);

        if (AWB_ALGO_1 == img_proc.awb_algo) {
            img_update_wb_bias(ae_info->sys_gain, &(awb_info->rb_bias));
        }

        img_update_gamma(ae_info->sys_gain);
    }

    if (ae_info->iso_update || imgproc_is_update_force()) {
        img_update_ae_target(ae_info->iso, &(ae_info->luma_target));
        img_update_dpc(ae_info->iso);
        img_update_cs(ae_info->iso);
        img_update_ee(ae_info->iso);
        img_update_nr(ae_info->iso);
        img_update_saturation(ae_info->iso);
    }

    if (awb_info->rb_gain_update || imgproc_is_update_force()) {
        if (AWB_ALGO_1 == img_proc.awb_algo) {
            img_update_wb_gain(&(awb_info->rb_gain), awb_info->color_temp, &(awb_info->rb_bias));
        }
    }

    if (awb_info->ct_update || imgproc_is_update_force()) {
        img_update_ccm(awb_info->color_temp);
        img_update_lsc(awb_info->color_temp);
    }

    imgproc_set_reg();

    imgproc_update_down();

    //imgproc_night_mode_enable(true);

#if PERFORMANCE_MONITOR
    do_frame_rate_stats("img handl", &ae_handl_cnt, FRM_CNT_FOR_ONE_STATS, &ae_handl_start_time);
#endif
}

void imgproc_night_mode_enable(bool enable)
{
    static bool pre_state;

    if (enable != pre_state) {
        ir_cut_switch(enable);
        day_night_mode = (enable ? BL_NIGHT_MODE : BL_DAY_MODE);
        pre_state = enable;
        //MSG("night mode %d\r\n", enable);
    }
}

int imgproc_start(void)
{
    img_proc.stop_imgproc_flag = 0;
    vImageControlTask();

    return 0;
}

int imgproc_stop(void)
{
    img_proc.stop_imgproc_flag = 1;

    return 0;
}

void imgproc_complete_init(void)
{
    uint32_t fifoThreshold = 0;
    
    ISP_TG_Cfg_Type tgCfg = {
        .sync_mode_value = ISP_SYNC_MODE_INPUT_VBLANK_NO_TOGGLE,
        .ISP_clk = ISP_USE_CLK,
        .pix_clk = PIX_USE_CLK,
        .fps = 25,
        .total_width = 2640,
        .total_height = 1125,
        .active_width = CAMERA_RESOLUTION_X,
        .active_height = CAMERA_RESOLUTION_Y,
        .out_width = CAMERA_RESOLUTION_X,
        .out_height = CAMERA_RESOLUTION_Y,
    };
    
    ae_config_t ae_cfg = {
        {
            {
                CAMERA_RESOLUTION_X,
                CAMERA_RESOLUTION_Y,
            },
            {
                CAMERA_RESOLUTION_X,
                CAMERA_RESOLUTION_Y,
            }
        },
    };
    
    gc2053_img_param.name = "GC2053";
    gc2053_img_param.state_tbl = &state_tbl;
    gc2053_img_param.ae_tbl = &ae_fw;
    gc2053_img_param.wb_info_tbl = &wb_info_use;
    gc2053_img_param.wb_bias_tbl = &wb_bias;
    gc2053_img_param.awb_white_region_tbl = &white_region_use;
    gc2053_img_param.blc_tbl = &black_lvl_corr;
    gc2053_img_param.defect_corr_tbl = &defect_corr;
    gc2053_img_param.bnr_fw_config_tbl = &bnr_fw_config;
    gc2053_img_param.lens_shading_corr_tbl = &lens_shading_corr;
    gc2053_img_param.color_corr_tbl = &color_corr;
    gc2053_img_param.gamma_corr_tbl = &gamma_corr;
    gc2053_img_param.wdr_fw_config_tbl = &wdr_fw_config;
    gc2053_img_param.saturation_tbl = &saturation;
    gc2053_img_param.noise_reduction_tbl = &noise_reduction;
    gc2053_img_param.edge_enhance_tbl = &edge_enhance;
    gc2053_img_param.cs_tbl = &chroma_suppress;
    
    img_param_init(&gc2053_img_param);
    
    ISP_Clock_Sel(ISP_CLK_160MHz, ENABLE, 1);
    ISP_Disable();
    ISP_Enable();
    ISP_Init();
    ISP_Set_DPC_State(ENABLE);
    ISP_Set_BNR_State(DISABLE);
    ISP_Set_LSC_State(ENABLE);
    ISP_Set_CCM_State(ENABLE);
    ISP_Set_Gamma_State(ENABLE);
    ISP_WDR_Set_WDR_State(ENABLE);
    ISP_Init_Color_Enhancement();
    ISP_Set_EE_State(ENABLE);
    ISP_Set_ChromaSuppress_State(ENABLE);
    ISP_MISC_DE_As_Hsync(DISABLE);
    ISP_MISC_Bayer_Shift(0x3ff,ISP_MISC_BAYER_SHIFT_LEFT,2);
    ISP_Set_TG_Cfg(&tgCfg);
    ISP_Set_Bayer_Pattern(BAYER_PATTERN_BG);
    ae_init();
    awb_init(AWB_ALGO_3);
    wdr_init();
    ae_config(&ae_cfg, 0);
    awb_config((awb_config_t*)&ae_cfg, 0);
    wdr_config((wdr_config_t*)&ae_cfg, 0);
    ISP_3DNR_Disable();
    imgproc_init();
    imgproc_control_init();
    fifoThreshold = (ISP_USE_CLK-PIX_USE_CLK)/1000*CAMERA_RESOLUTION_X/(ISP_USE_CLK/1000)+10;
    DVP_TSRC_Sensor_Input_Set(DVP_TSRC0_ID,fifoThreshold,DISABLE,DISABLE);
    load_isp_back_reg();
}

